---
type: MaterialNode
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# MaterialNode

`Autodesk.Revit.DB.MaterialNode` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetAppearance | 2014 | `public Asset GetAppearance ()` |
| Method | GetAppearanceOverride | 2014 | `public Asset GetAppearanceOverride ()` |
| Property | Color | 2014 | `public Color Color { get ; }` |
| Property | Glossiness | 2014 | `public int Glossiness { get ; }` |
| Property | HasOverriddenAppearance | 2014 | `public bool HasOverriddenAppearance { get ; }` |
| Property | MaterialId | 2014 | `public ElementId MaterialId { get ; }` |
| Property | Smoothness | 2014 | `public int Smoothness { get ; }` |
| Property | ThumbnailFile | 2014 | `public string ThumbnailFile { get ; }` |
| Property | Transparency | 2014 | `public double Transparency { get ; }` |